###Excersize 1###
# Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

print(f'Mean = {(200+800)/2}\nVariance = {(800-200)**2/12}')

#Mean = 500.0
#Variance = 30000.0